let tableConfig = {
  bindto: '#table_1',
  label: {
    format: [],
    text: []
  },
  color: {
    schemes: [['red', 'blue']],
    opacity: [],
    colors: []
  },
  data: {
    type: 'table',
    json: [
      { 'sum(销售数量)': 797959, 'sum(销售金额)': 29137857.229999926, 产品主类: '彩妆', 品牌: '无品牌信息' },
      { 'sum(销售数量)': 2848244, 'sum(销售金额)': 156681327.89000332, 产品主类: '彩妆', 品牌: '国际品牌' },
      { 'sum(销售数量)': 172295, 'sum(销售金额)': 2358534.489999993, 产品主类: '彩妆', 品牌: '国内品牌' },
      { 'sum(销售数量)': 363528, 'sum(销售金额)': 1594013.0999999996, 产品主类: '儿童', 品牌: '无品牌信息' },
      { 'sum(销售数量)': 605053, 'sum(销售金额)': 6952265.899999972, 产品主类: '儿童', 品牌: '国际品牌' },
      { 'sum(销售数量)': 49058, 'sum(销售金额)': 381666.37999999983, 产品主类: '儿童', 品牌: '国内品牌' },
      { 'sum(销售数量)': 150734, 'sum(销售金额)': 1439978.7799999996, 产品主类: '化妆工具', 品牌: '无品牌信息' },
      { 'sum(销售数量)': 114052, 'sum(销售金额)': 1448612.1600000006, 产品主类: '化妆工具', 品牌: '国际品牌' },
      { 'sum(销售数量)': 102256, 'sum(销售金额)': 969937.1700000004, 产品主类: '化妆工具', 品牌: '国内品牌' },
      { 'sum(销售数量)': 1753848, 'sum(销售金额)': 14534142.900000066, 产品主类: '居家日用', 品牌: '无品牌信息' },
      { 'sum(销售数量)': 2336088, 'sum(销售金额)': 25631851.750000045, 产品主类: '居家日用', 品牌: '国际品牌' },
      { 'sum(销售数量)': 451322, 'sum(销售金额)': 5023255.579999978, 产品主类: '居家日用', 品牌: '国内品牌' },
      { 'sum(销售数量)': 277595, 'sum(销售金额)': 2840436.7499999986, 产品主类: '服饰', 品牌: '无品牌信息' },
      { 'sum(销售数量)': 23656, 'sum(销售金额)': 650437.1100000007, 产品主类: '服饰', 品牌: '国际品牌' },
      { 'sum(销售数量)': NaN, 'sum(销售金额)': NaN, 产品主类: '服饰', 品牌: '国内品牌' }
    ],
    colored: {
      feature: 'sum(销售金额)',
      type: 'linear'
    },
    labeled: ['sum(销售数量)', 'sum(销售金额)'],
    range: {
      // [[], []]
      color: []
    },
    column: {
      categories: ['产品主类'],
      aggressions: []
    },
    row: {
      categories: ['品牌'],
      aggressions: []
    },
    table: {
      // 外边框
      outter: {
        color: '#424242',
        width: 2
      },
      // 内边框
      inner: {
        color: '#a4a4a4',
        width: 1
      },
      // 边距
      padding: {
        top: 0, left: 0, bottom: 0, right: 0
      },
      // 表头
      header: {
        top: {
          height: 35
        },
        left: {
          width: 100
        },
        auto: true
      },
      // cell
      body: {
        width: 90,
        height: 24,
        auto: true
      }
    }
  }
};

let tableData = [
  { 'sum(销售数量)': 797959, 'sum(销售金额)': 29137857.229999926, 产品主类: '彩妆', 品牌: '无品牌信息' },
  { 'sum(销售数量)': 2848244, 'sum(销售金额)': 156681327.89000332, 产品主类: '彩妆', 品牌: '国际品牌' },
  { 'sum(销售数量)': 172295, 'sum(销售金额)': 2358534.489999993, 产品主类: '彩妆', 品牌: '国内品牌' },
  { 'sum(销售数量)': 363528, 'sum(销售金额)': 1594013.0999999996, 产品主类: '儿童', 品牌: '无品牌信息' },
  { 'sum(销售数量)': 605053, 'sum(销售金额)': 6952265.899999972, 产品主类: '儿童', 品牌: '国际品牌' },
  { 'sum(销售数量)': 49058, 'sum(销售金额)': 381666.37999999983, 产品主类: '儿童', 品牌: '国内品牌' },
  { 'sum(销售数量)': 150734, 'sum(销售金额)': 1439978.7799999996, 产品主类: '化妆工具', 品牌: '无品牌信息' },
  { 'sum(销售数量)': 114052, 'sum(销售金额)': 1448612.1600000006, 产品主类: '化妆工具', 品牌: '国际品牌' },
  { 'sum(销售数量)': 102256, 'sum(销售金额)': 969937.1700000004, 产品主类: '化妆工具', 品牌: '国内品牌' },
  { 'sum(销售数量)': 1753848, 'sum(销售金额)': 14534142.900000066, 产品主类: '居家日用', 品牌: '无品牌信息' },
  { 'sum(销售数量)': 2336088, 'sum(销售金额)': 25631851.750000045, 产品主类: '居家日用', 品牌: '国际品牌' },
  { 'sum(销售数量)': 451322, 'sum(销售金额)': 5023255.579999978, 产品主类: '居家日用', 品牌: '国内品牌' },
  { 'sum(销售数量)': 277595, 'sum(销售金额)': 2840436.7499999986, 产品主类: '服饰', 品牌: '无品牌信息' },
  { 'sum(销售数量)': 23656, 'sum(销售金额)': 650437.1100000007, 产品主类: '服饰', 品牌: '国际品牌' },
  { 'sum(销售数量)': NaN, 'sum(销售金额)': NaN, 产品主类: '服饰', 品牌: '国内品牌' }
];

let tableInstance = chart.GeometryDrawingProcess({ data: tableData, config: tableConfig, chartType: 'table' });

tableInstance.draw();
