const config = {
  fitModel: 'standard',
  width: 600,
  height: 600,
  id: 'mc_bar',
  isCombined: false,
  xAxisPart: [{
    position: 'top',
    key: '省份',
    line: {
      style: {
        lineWidth: 1,
        fontColor: '#c2c9d1',
        opacity: 1,
        lineDash: [0, 0]
      }
    },
    label: {
      style: {
        fontColor: 'blue',
        fontStyle: 'normal',
        fontSize: 14,
        fontWeight: 'normal',
        opacity: 1
      },
      rotate: 0
    },
    title: {
      value: '产品主类/省份/是否为天美品牌',
      style: {
        fontColor: 'blue',
        fontSize: 16,
        fontWeight: 'normal',
        fontStyle: 'normal'
      }
    },
    grid: {
      line: {
        style: {
          fontColor: '#c2c9d1',
          opacity: 0,
          lineDash: [0, 0], // [3,3]
          lineWidth: 1
        }
      }
    }
  }, {
    position: 'top',
    key: '是否为天美品牌',
    line: {
      style: {
        lineWidth: 1,
        fontColor: '#c2c9d1',
        opacity: 1,
        lineDash: [0, 0]
      }
    },
    label: {
      style: {
        fontColor: 'blue',
        fontStyle: 'normal',
        fontSize: 14,
        fontWeight: 'normal',
        opacity: 1
      },
      rotate: 0
    },
    title: {
      style: {
        fontColor: 'blue',
        fontSize: 16,
        fontWeight: 'normal',
        fontStyle: 'normal'
      }
    },
    grid: {
      line: {
        style: {
          fontColor: '#c2c9d1',
          opacity: 0,
          lineDash: [0, 0], // [3,3]
          lineWidth: 1
        }
      }
    }
  // }, {
  //   position: 'top',
  //   key: '是否为天美品牌',
  //   line: {
  //     style: {
  //       lineWidth: 1,
  //       fontColor: '#c2c9d1',
  //       opacity: 1,
  //       lineDash: [0, 0]
  //     }
  //   },
  //   label: {
  //     style: {
  //       fontColor: 'blue',
  //       fontStyle: 'normal',
  //       fontSize: 14,
  //       fontWeight: 'normal',
  //       opacity: 1
  //     },
  //     rotate: 0
  //   },
  //   title: {
  //     style: {
  //       fontColor: 'blue',
  //       fontSize: 16,
  //       fontWeight: 'normal',
  //       fontStyle: 'normal'
  //     }
  //   },
  //   grid: {
  //     line: {
  //       style: {
  //         fontColor: '#c2c9d1',
  //         opacity: 0,
  //         lineDash: [0, 0], // [3,3]
  //         lineWidth: 1
  //       }
  //     }
  //   }
  }],
  xAxis: [{
    position: 'bottom',
    key: '产品主类',
    line: {
      style: {
        lineWidth: 1,
        fontColor: '#c2c9d1',
        opacity: 1,
        lineDash: [0, 0]
      }
    },
    label: {
      style: {
        fontColor: 'blue',
        fontSize: 14,
        fontWeight: 'normal',
        opacity: 1
      },
      rotate: 0
    },
    title: {
      value: 'Sex',
      style: {
        fontColor: 'blue',
        fontSize: 16,
        fontStyle: 'normal'
      }
    },
    grid: {
      line: {
        style: {
          fontColor: '#c2c9d1',
          opacity: 0,
          lineDash: [0, 0], // [3,3]
          lineWidth: 1
        }
      }
    }
  }],
  // yAxisPart: [{
  //   position: 'left-part',
  //   key: ['省份'],
  //   line: {
  //     style: {
  //       lineWidth: 1,
  //       fontColor: '#c2c9d1',
  //       opacity: 1,
  //       lineDash: [0, 0]
  //     }
  //   },
  //   label: {
  //     style: {
  //       fontColor: 'blue',
  //       fontStyle: 'normal',
  //       fontSize: 14,
  //       fontWeight: 'normal',
  //       opacity: 1
  //     },
  //     rotate: 0
  //   }
  // }, {
  //   position: 'left-part',
  //   key: ['Cabin'],
  //   line: {
  //     style: {
  //       lineWidth: 1,
  //       fontColor: '#c2c9d1',
  //       opacity: 1,
  //       lineDash: [0, 0]
  //     }
  //   },
  //   label: {
  //     style: {
  //       fontColor: 'blue',
  //       fontStyle: 'normal',
  //       fontSize: 14,
  //       fontWeight: 'normal',
  //       opacity: 1
  //     },
  //     rotate: 0
  //   }
  // }, {
  //   position: 'left-part',
  //   key: ['是否为天美品牌'],
  //   line: {
  //     style: {
  //       lineWidth: 1,
  //       fontColor: '#c2c9d1',
  //       opacity: 1,
  //       lineDash: [0, 0]
  //     }
  //   },
  //   label: {
  //     style: {
  //       fontColor: 'blue',
  //       fontStyle: 'normal',
  //       fontSize: 14,
  //       fontWeight: 'normal',
  //       opacity: 1
  //     },
  //     rotate: 0,
  //     formatter: (text, item, index) => {
  //       return text;
  //     }
  //   },
  //   title: {
  //     value: 'Cabin',
  //     style: {
  //       fontColor: 'blue',
  //       fontSize: 16,
  //       fontWeight: 'normal',
  //       fontStyle: 'normal'
  //     }
  //   },
  //   grid: {
  //     line: {
  //       style: {
  //         fontColor: '#c2c9d1',
  //         opacity: 0,
  //         lineDash: [0, 0], // [3,3]
  //         lineWidth: 1
  //       }
  //     }
  //   }
  // }],
  yAxis: [[{
    position: 'left',
    type: ['bar'],
    key: ['sum(平均售价)'],
    line: {
      style: {
        lineWidth: 1,
        fontColor: '#c2c9d1',
        opacity: 1,
        lineDash: [0, 0]
      }
    },
    label: {
      style: {
        fontColor: 'blue',
        fontStyle: 'normal',
        fontSize: 14,
        fontWeight: 'normal',
        opacity: 1
      },
      rotate: 0,
      formatter: (text, item, index) => {
        return text;
      }
    },
    title: {
      value: 'sum(平均售价)',
      style: {
        fontColor: 'blue',
        fontSize: 16,
        fontWeight: 'normal',
        fontStyle: 'normal'
      }
    },
    grid: {
      line: {
        style: {
          fontColor: '#c2c9d1',
          opacity: 0,
          lineDash: [0, 0], // [3,3]
          lineWidth: 1
        }
      }
    }
    // }, {
    //   position: 'right',
    //   type: ['line'], // 组合图需要
    //   key: ['sum(平均售价)', 'sum(销售金额)'],
    //   line: {
    //     style: {
    //       lineWidth: 1,
    //       fontColor: '#c2c9d1',
    //       opacity: 1,
    //       lineDash: [0, 0]
    //     }
    //   },
    //   label: {
    //     style: {
    //       fontColor: 'blue',
    //       fontStyle: 'normal',
    //       fontSize: 14,
    //       fontWeight: 'normal',
    //       opacity: 1
    //     },
    //     rotate: 0,
    //     formatter: (text, item, index) => {
    //       return text;
    //     }
    //   },
    //   title: {
    //     value: 'sum(平均售价)',
    //     style: {
    //       fontColor: 'blue',
    //       fontSize: 16,
    //       fontWeight: 'normal',
    //       fontStyle: 'normal'
    //     }
    //   },
    //   grid: {
    //     line: {
    //       style: {
    //         fontColor: '#c2c9d1',
    //         opacity: 0,
    //         lineDash: [0, 0], // [3,3]
    //         lineWidth: 1
    //       }
    //     }
    //   }
    // }], [{
    //   position: 'left',
    //   type: ['line'], // 组合图需要
    //   key: ['sum(销售数量)'],
    //   line: {
    //     style: {
    //       lineWidth: 1,
    //       fontColor: '#c2c9d1',
    //       opacity: 1,
    //       lineDash: [0, 0]
    //     }
    //   },
    //   label: {
    //     style: {
    //       fontColor: 'blue',
    //       fontStyle: 'normal',
    //       fontSize: 14,
    //       fontWeight: 'normal',
    //       opacity: 1
    //     },
    //     rotate: 0,
    //     formatter: (text, item, index) => {
    //       return text;
    //     }
    //   },
    //   title: {
    //     value: 'sum(销售数量)',
    //     style: {
    //       fontColor: 'blue',
    //       fontSize: 16,
    //       fontWeight: 'normal',
    //       fontStyle: 'normal'
    //     }
    //   },
    //   grid: {
    //     line: {
    //       style: {
    //         fontColor: '#c2c9d1',
    //         opacity: 0,
    //         lineDash: [0, 0], // [3,3]
    //         lineWidth: 1
    //       }
    //     }
    //   }
    // }, {
    //   position: 'right',
    //   type: ['line'], // 组合图需要
    //   key: ['sum(销售金额)'],
    //   line: {
    //     style: {
    //       lineWidth: 1,
    //       fontColor: '#c2c9d1',
    //       opacity: 1,
    //       lineDash: [0, 0]
    //     }
    //   },
    //   label: {
    //     style: {
    //       fontColor: 'blue',
    //       fontStyle: 'normal',
    //       fontSize: 14,
    //       fontWeight: 'normal',
    //       opacity: 1
    //     },
    //     rotate: 0,
    //     formatter: (text, item, index) => {
    //       return text;
    //     }
    //   },
    //   title: {
    //     value: 'sum(销售金额)',
    //     style: {
    //       fontColor: 'blue',
    //       fontSize: 16,
    //       fontWeight: 'normal',
    //       fontStyle: 'normal'
    //     }
    //   },
    //   grid: {
    //     line: {
    //       style: {
    //         fontColor: '#c2c9d1',
    //         opacity: 0,
    //         lineDash: [0, 0], // [3,3]
    //         lineWidth: 1
    //       }
    //     }
    //   }
  }]]
  // labelsList: [
  //   {
  //     type: 'linear',
  //     key: 'sum(销售金额)',
  //     title: 'sum(客户编号)',
  //     display: 'auto',
  //     format: {
  //       selectFormat: -1,
  //       decimal: 2,
  //       negative: '-1',
  //       unit: '',
  //       prefix: '',
  //       suffix: '',
  //       zone: 'CN',
  //       useThousandMark: true
  //     },
  //     text: {
  //       fontColor: '#6b6b6b',
  //       fontSize: 12,
  //       textAlign: 'left',
  //       lineHeight: 24,
  //       display: 'auto'
  //     }
  //   }
  //   // {
  //   //   type: 'linear',
  //   //   key: 'median(客户ID) percent',
  //   //   title: 'median(客户ID) percent',
  //   //   display: 'auto',
  //   //   format: {
  //   //     selectFormat: 'percent',
  //   //     decimal: 2,
  //   //     prefix: '',
  //   //     suffix: '%',
  //   //     isPercent: true
  //   //   },
  //   //   text: {
  //   //     fontColor: '#6b6b6b',
  //   //     fontSize: 12,
  //   //     textAlign: 'left',
  //   //     lineHeight: 24,
  //   //     display: 'auto'
  //   //   }
  //   // },
  //   // {
  //   //   type: 'ordinal',
  //   //   key: '区域',
  //   //   title: '区域',
  //   //   display: 'auto',
  //   //   format: {},
  //   //   text: {
  //   //     fontColor: '#6b6b6b',
  //   //     fontSize: 12,
  //   //     textAlign: 'left',
  //   //     lineHeight: 24,
  //   //     display: 'auto'
  //   //   }
  //   // }
  // ]
  // tooltipList: [
  //   {
  //     type: 'linear',
  //     key: 'median(客户ID)',
  //     title: 'median(客户ID)',
  //     display: 'auto',
  //     format: {
  //       selectFormat: -1,
  //       decimal: 2,
  //       negative: '-1',
  //       unit: '',
  //       prefix: '',
  //       suffix: '',
  //       zone: 'CN',
  //       useThousandMark: true
  //     },
  //     text: {
  //       fontColor: '#6b6b6b',
  //       fontSize: 12,
  //       textAlign: 'left',
  //       lineHeight: 24,
  //       display: 'auto'
  //     }
  //   },
  //   {
  //     type: 'linear',
  //     key: 'median(客户ID) percent',
  //     title: 'median(客户ID) percent',
  //     display: 'auto',
  //     format: {
  //       selectFormat: 'percent',
  //       decimal: 2,
  //       prefix: '',
  //       suffix: '%',
  //       isPercent: true
  //     },
  //     text: {
  //       fontColor: '#6b6b6b',
  //       fontSize: 12,
  //       textAlign: 'left',
  //       lineHeight: 24,
  //       display: 'auto'
  //     }
  //   },
  //   {
  //     type: 'linear',
  //     key: 'sum(数量)',
  //     title: 'sum(数量)',
  //     display: 'auto',
  //     format: {
  //       selectFormat: -1,
  //       decimal: 2,
  //       negative: '-1',
  //       unit: '',
  //       prefix: '',
  //       suffix: '',
  //       zone: 'CN',
  //       useThousandMark: true
  //     },
  //     text: {
  //       fontColor: '#6b6b6b',
  //       fontSize: 12,
  //       textAlign: 'left',
  //       lineHeight: 24,
  //       display: 'auto'
  //     }
  //   },
  //   {
  //     type: 'ordinal',
  //     key: '区域',
  //     title: '区域',
  //     display: 'auto',
  //     format: {},
  //     text: {
  //       fontColor: '#6b6b6b',
  //       fontSize: 12,
  //       textAlign: 'left',
  //       lineHeight: 24,
  //       display: 'auto'
  //     }
  //   }
  // ],
  // labelFeature: [
  //   { type: 'linear', feature: 'median(客户ID)' },
  //   { type: 'ordinal', feature: '区域' }
  // ],
  // colorFeature: [
  //   { feature: '', type: 'ordinal', key: 'sum(PassengerId)' },
  //   { feature: '', type: 'linear', key: 'sum(PassengerId)' }
  // ]
};

const data = [[{ 'sum(平均售价)': 414.05746336899995, 产品主类: '儿童', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 3687.0286057790013, 产品主类: '化妆工具', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 940.1385854309999, 产品主类: '儿童', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 3027.9144292040014, 产品主类: '化妆工具', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 19518.02323717097, 产品主类: '儿童', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 5759.063944539999, 产品主类: '化妆工具', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 447.93761285399995, 产品主类: '儿童', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 1645.4724428480008, 产品主类: '化妆工具', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 1420.4877934790004, 产品主类: '儿童', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 1732.8906268619996, 产品主类: '化妆工具', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 22992.772991665992, 产品主类: '儿童', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 3351.9064755590016, 产品主类: '化妆工具', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }]];

// const data = [[{ 'sum(平均售价)': 1490.5278634919998, 产品主类: 'null', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 3040.575659442999, 产品主类: 'null', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 220142.05681928195, 产品主类: 'null', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 1629.7454990830004, 产品主类: '个人护理', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 14312.357294617996, 产品主类: '个人护理', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 136708.9044568634, 产品主类: '个人护理', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 414.05746336899995, 产品主类: '儿童', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 940.1385854309999, 产品主类: '儿童', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 19518.02323717097, 产品主类: '儿童', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 3687.0286057790013, 产品主类: '化妆工具', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 3027.9144292040014, 产品主类: '化妆工具', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 5759.063944539999, 产品主类: '化妆工具', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 836.4946047370001, 产品主类: 'null', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 771.4327831770001, 产品主类: 'null', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 149419.44050501296, 产品主类: 'null', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 1456.09946851, 产品主类: '个人护理', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 9205.732992404004, 产品主类: '个人护理', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 109836.26819961607, 产品主类: '个人护理', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 447.93761285399995, 产品主类: '儿童', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 1420.4877934790004, 产品主类: '儿童', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 22992.772991665992, 产品主类: '儿童', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 1645.4724428480008, 产品主类: '化妆工具', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 1732.8906268619996, 产品主类: '化妆工具', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 3351.9064755590016, 产品主类: '化妆工具', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 677.0068635450002, 产品主类: 'null', 是否为天美品牌: '天美品牌', 省份: '吉林省' }, { 'sum(平均售价)': 690.92316937, 产品主类: 'null', 是否为天美品牌: '无品牌信息', 省份: '吉林省' }, { 'sum(平均售价)': 89073.98733696718, 产品主类: 'null', 是否为天美品牌: '非天美品牌', 省份: '吉林省' }, { 'sum(平均售价)': 963.9953733059999, 产品主类: '个人护理', 是否为天美品牌: '天美品牌', 省份: '吉林省' }, { 'sum(平均售价)': 7576.112015683, 产品主类: '个人护理', 是否为天美品牌: '无品牌信息', 省份: '吉林省' }, { 'sum(平均售价)': 63636.77357436021, 产品主类: '个人护理', 是否为天美品牌: '非天美品牌', 省份: '吉林省' }, { 'sum(平均售价)': 258.01514707700005, 产品主类: '儿童', 是否为天美品牌: '天美品牌', 省份: '吉林省' }, { 'sum(平均售价)': 580.0018180669999, 产品主类: '儿童', 是否为天美品牌: '无品牌信息', 省份: '吉林省' }, { 'sum(平均售价)': 11454.67513200299, 产品主类: '儿童', 是否为天美品牌: '非天美品牌', 省份: '吉林省' }, { 'sum(平均售价)': 1679.0692932109996, 产品主类: '化妆工具', 是否为天美品牌: '天美品牌', 省份: '吉林省' }, { 'sum(平均售价)': 1386.734409215, 产品主类: '化妆工具', 是否为天美品牌: '无品牌信息', 省份: '吉林省' }, { 'sum(平均售价)': 2539.7839270869995, 产品主类: '化妆工具', 是否为天美品牌: '非天美品牌', 省份: '吉林省' }, { 'sum(平均售价)': 1861.5885319670003, 产品主类: 'null', 是否为天美品牌: '天美品牌', 省份: '四川省' }, { 'sum(平均售价)': 3855.0523933910017, 产品主类: 'null', 是否为天美品牌: '无品牌信息', 省份: '四川省' }, { 'sum(平均售价)': 267519.88704195735, 产品主类: 'null', 是否为天美品牌: '非天美品牌', 省份: '四川省' }, { 'sum(平均售价)': 2788.6433313, 产品主类: '个人护理', 是否为天美品牌: '天美品牌', 省份: '四川省' }, { 'sum(平均售价)': 23466.619267470014, 产品主类: '个人护理', 是否为天美品牌: '无品牌信息', 省份: '四川省' }, { 'sum(平均售价)': 202731.53000957824, 产品主类: '个人护理', 是否为天美品牌: '非天美品牌', 省份: '四川省' }, { 'sum(平均售价)': 654.6369475339997, 产品主类: '儿童', 是否为天美品牌: '天美品牌', 省份: '四川省' }, { 'sum(平均售价)': 997.0910274820002, 产品主类: '儿童', 是否为天美品牌: '无品牌信息', 省份: '四川省' }, { 'sum(平均售价)': 26434.16056871199, 产品主类: '儿童', 是否为天美品牌: '非天美品牌', 省份: '四川省' }, { 'sum(平均售价)': 5249.769577092, 产品主类: '化妆工具', 是否为天美品牌: '天美品牌', 省份: '四川省' }, { 'sum(平均售价)': 5554.223711294, 产品主类: '化妆工具', 是否为天美品牌: '无品牌信息', 省份: '四川省' }, { 'sum(平均售价)': 6262.894962603, 产品主类: '化妆工具', 是否为天美品牌: '非天美品牌', 省份: '四川省' }]];

// const data = [[
//   { 'sum(客户编号)': 450000, 'sum(平均售价)': 1000, 'sum(销售金额)': 2320, 'sum(销售数量)': 3300, 省: '湖北省', 市: '武汉市', 区域: '华中', 产品主类: '护理' },
//   { 'sum(客户编号)': NaN, 'sum(平均售价)': 1000, 'sum(销售金额)': 2320, 'sum(销售数量)': 3400, 省: '湖北省', 市: '武汉市', 区域: '华中', 产品主类: '护肤' },
//   { 'sum(客户编号)': 1265, 'sum(平均售价)': 1000, 'sum(销售金额)': 2320, 'sum(销售数量)': 3500, 省: '湖北省', 市: '武汉市', 区域: '华中', 产品主类: '化妆' },
//   { 'sum(客户编号)': 2865, 'sum(平均售价)': 1500, 'sum(销售金额)': 2320, 'sum(销售数量)': 3600, 省: '河南省', 市: '郑州市', 区域: '华中', 产品主类: '护理' },
//   { 'sum(客户编号)': 1865, 'sum(平均售价)': 1600, 'sum(销售金额)': 2320, 'sum(销售数量)': 3700, 省: '河南省', 市: '郑州市', 区域: '华中', 产品主类: '护肤' },
//   { 'sum(客户编号)': 1965, 'sum(平均售价)': 1800, 'sum(销售金额)': 2320, 'sum(销售数量)': 3800, 省: '河南省', 市: '郑州市', 区域: '华中', 产品主类: '化妆' },
//   { 'sum(客户编号)': 1065, 'sum(平均售价)': 1190, 'sum(销售金额)': 2320, 'sum(销售数量)': 3900, 省: '福建省', 市: '厦门市', 区域: '华东', 产品主类: '护理' },
//   { 'sum(客户编号)': 2065, 'sum(平均售价)': 1300, 'sum(销售金额)': 2320, 'sum(销售数量)': 4000, 省: '福建省', 市: '厦门市', 区域: '华东', 产品主类: '护肤' },
//   { 'sum(客户编号)': 1865, 'sum(平均售价)': 1200, 'sum(销售金额)': 2320, 'sum(销售数量)': 3100, 省: '福建省', 市: '厦门市', 区域: '华东', 产品主类: '化妆' },
//   { 'sum(客户编号)': 1165, 'sum(平均售价)': 1290, 'sum(销售金额)': 2120, 'sum(销售数量)': 3900, 省: '福建省', 市: '福州市', 区域: '华东', 产品主类: '护理' },
//   { 'sum(客户编号)': 2165, 'sum(平均售价)': 1200, 'sum(销售金额)': 2120, 'sum(销售数量)': 4000, 省: '福建省', 市: '福州市', 区域: '华东', 产品主类: '护肤' },
//   { 'sum(客户编号)': 1265, 'sum(平均售价)': 1100, 'sum(销售金额)': 2120, 'sum(销售数量)': 3100, 省: '福建省', 市: '福州市', 区域: '华东', 产品主类: '化妆' }],
// [
//   { 'sum(销售数量)': 3500, 省: '湖北省', 市: '武汉市', 'sum(平均售价)': 1200, 'sum(销售金额)': 1320, 产品主类: '护理' },
//   { 'sum(销售数量)': 3500, 省: '湖北省', 市: '武汉市', 'sum(平均售价)': 1200, 'sum(销售金额)': 1320, 产品主类: '护肤' },
//   { 'sum(销售数量)': 3500, 省: '湖北省', 市: '武汉市', 'sum(平均售价)': 1200, 'sum(销售金额)': 1320, 产品主类: '化妆' },
//   { 'sum(销售数量)': 2820, 省: '河南省', 市: '郑州市', 'sum(平均售价)': 1300, 'sum(销售金额)': 1400, 产品主类: '护理' },
//   { 'sum(销售数量)': 2820, 省: '河南省', 市: '郑州市', 'sum(平均售价)': 1300, 'sum(销售金额)': 1400, 产品主类: '护肤' },
//   { 'sum(销售数量)': 2820, 省: '河南省', 市: '郑州市', 'sum(平均售价)': 1300, 'sum(销售金额)': 1400, 产品主类: '化妆' },
//   { 'sum(销售数量)': 2290, 省: '福建省', 市: '厦门市', 'sum(平均售价)': 1400, 'sum(销售金额)': 1300, 产品主类: '护理' },
//   { 'sum(销售数量)': 2290, 省: '福建省', 市: '厦门市', 'sum(平均售价)': 1400, 'sum(销售金额)': 1300, 产品主类: '护肤' },
//   { 'sum(销售数量)': 2290, 省: '福建省', 市: '厦门市', 'sum(平均售价)': 1400, 'sum(销售金额)': 1300, 产品主类: '化妆' },
//   { 'sum(销售数量)': 4220, 省: '福建省', 市: '福州市', 'sum(平均售价)': 1500, 'sum(销售金额)': 1560, 产品主类: '护理' },
//   { 'sum(销售数量)': 4220, 省: '福建省', 市: '福州市', 'sum(平均售价)': 1500, 'sum(销售金额)': 1560, 产品主类: '护肤' },
//   { 'sum(销售数量)': 4220, 省: '福建省', 市: '福州市', 'sum(平均售价)': 1500, 'sum(销售金额)': 1560, 产品主类: '化妆' }
// ]];

// const data = [
//   { 'sum(客户编号)': 3100, 产品主类: '化妆品' },
//   { 'sum(客户编号)': 3200, 产品主类: '化妆品' },
//   { 'sum(客户编号)': 2500, 产品主类: '化妆品' },
//   { 'sum(客户编号)': 3500, 产品主类: '化妆品' }
// ];

// const data = [[
//   { Embarked: 'C', Name: 'Abelson, Mrs. Samuel (Hannah Wizosky)', Sex: 'female', 'sum(PassengerId)': 875 },
//   { Embarked: 'S', Name: 'Abbott, Mrs. Stanton (Rosa Hunt)', Sex: 'female', 'sum(PassengerId)': 280 },
//   { Embarked: 'C', Name: 'Abelson, Mr. Samuel', Sex: 'male', 'sum(PassengerId)': 309 },
//   { Embarked: 'S', Name: 'Abbing, Mr. Anthony', Sex: 'male', 'sum(PassengerId)': 846 },
//   { Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'male', 'sum(PassengerId)': 747 },
//   { Embarked: 'C', Name: 'Abelson, Mr. Samuel', Sex: 'null', 'sum(PassengerId)': 309 },
//   { Embarked: 'C', Name: 'Abbing, Mr. Anthony', Sex: 'null', 'sum(PassengerId)': 846 },
//   { Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'null', 'sum(PassengerId)': 747 }
// ]];

// const data = [[
//   { Embarked: 'C', Name: 'Abbing, Mr. Anthony', Sex: 'female', 'sum(PassengerId)': 3 },
//   { Embarked: 'S', Name: 'Abbing, Mr. Anthony', Sex: 'female', 'sum(PassengerId)': 3 },
//   { Embarked: 'C', Name: 'Abbing, Mr. Anthony', Sex: 'male', 'sum(PassengerId)': 2 },
//   { Embarked: 'S', Name: 'Abbing, Mr. Anthony', Sex: 'male', 'sum(PassengerId)': 2 },
//   { Embarked: 'C', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'female', 'sum(PassengerId)': 2 },
//   { Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'female', 'sum(PassengerId)': 2 },
//   { Embarked: 'C', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'male', 'sum(PassengerId)': 6 },
//   { Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'male', 'sum(PassengerId)': 6 },
//   { Embarked: 'C', Name: 'Abelson, Mr. Samuel', Sex: 'female', 'sum(PassengerId)': 5 },
//   { Embarked: 'S', Name: 'Abelson, Mr. Samuel', Sex: 'female', 'sum(PassengerId)': 5 },
//   { Embarked: 'C', Name: 'Abelson, Mr. Samuel', Sex: 'male', 'sum(PassengerId)': 1 },
//   { Embarked: 'S', Name: 'Abelson, Mr. Samuel', Sex: 'male', 'sum(PassengerId)': 1 },
//   { Embarked: 'C', Name: 'Abbott, Mrs. Stanton', Sex: 'female', 'sum(PassengerId)': 8 },
//   { Embarked: 'S', Name: 'Abbott, Mrs. Stanton', Sex: 'female', 'sum(PassengerId)': 8 },
//   { Embarked: 'C', Name: 'Abbott, Mrs. Stanton', Sex: 'male', 'sum(PassengerId)': 6 },
//   { Embarked: 'S', Name: 'Abbott, Mrs. Stanton', Sex: 'male', 'sum(PassengerId)': 6 },
// ]];

// const data = [[
//   { Name: 'Abbing, Mr. Anthony', Sex: 'female', 'sum(PassengerId)': 3 },
//   { Name: 'Abbing, Mr. Anthony', Sex: 'male', 'sum(PassengerId)': 3 },
//   { Name: 'Abbott, Mr. Rossmore Edward', Sex: 'female', 'sum(PassengerId)': 3 },
//   { Name: 'Abbott, Mr. Rossmore Edward', Sex: 'female', 'sum(PassengerId)': 3 },
// ]]

// const data = [[
//   { Cabin: 'null', Embarked: 'C', Name: 'Abelson, Mrs. Samuel (Hannah Wizosky)', Sex: 'female', 'sum(PassengerId)': 875 },
//   { Cabin: 'null', Embarked: 'C', Name: 'Abelson, Mr. Samuel', Sex: 'male', 'sum(PassengerId)': 309 },
//   { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mrs. Stanton (Rosa Hunt)', Sex: 'female', 'sum(PassengerId)': 280 },
//   { Cabin: 'null', Embarked: 'S', Name: 'Abbing, Mr. Anthony', Sex: 'male', 'sum(PassengerId)': 846 },
//   { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'male', 'sum(PassengerId)': 747 }
// ]];

// const data = [
//   [
//     { Cabin: 'null', Embarked: 'C', Name: 'Abelson, Mrs. Samuel (Hannah Wizosky)', Sex: 'female', 'sum(PassengerId)': 875 },
//     { Cabin: 'null', Embarked: 'C', Name: 'Abelson, Mr. Samuel', Sex: 'male', 'sum(PassengerId)': 309 },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mrs. Stanton (Rosa Hunt)', Sex: 'female', 'sum(PassengerId)': 280 },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbing, Mr. Anthony', Sex: 'male', 'sum(PassengerId)': 846 },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'male', 'sum(PassengerId)': 747 }
//   ]];

// const data = [
//   [
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbing, Mr. Anthony', Sex: 'female', 'sum(PassengerId)': NaN },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'female', 'sum(PassengerId)': NaN },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mrs. Stanton (Rosa Hunt)', Sex: 'female', 'sum(PassengerId)': 280.0 },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbing, Mr. Anthony', Sex: 'male', 'sum(PassengerId)': 846.0 },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'male', 'sum(PassengerId)': 747.0 },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mrs. Stanton (Rosa Hunt)', Sex: 'male', 'sum(PassengerId)': NaN }
//   ]
// ];

// const data = [
//   [
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbing, Mr. Anthony', Sex: 'female', 'sum(PassengerId)': NaN },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'female', 'sum(PassengerId)': NaN },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mrs. Stanton (Rosa Hunt)', Sex: 'female', 'sum(PassengerId)': 280.0 },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbing, Mr. Anthony', Sex: 'male', 'sum(PassengerId)': 846.0 },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'male', 'sum(PassengerId)': 747.0 },
//     { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mrs. Stanton (Rosa Hunt)', Sex: 'male', 'sum(PassengerId)': NaN }
//   ]
// ];

// const data = [
//   [
//     {"Cabin":"null","Name":"Abbing, Mr. Anthony","Sex":"female","sum(PassengerId)":NaN},
//     {"Cabin":"null","Name":"Abbott, Mr. Rossmore Edward","Sex":"female","sum(PassengerId)":NaN},
//     {"Cabin":"null","Name":"Abbott, Mrs. Stanton (Rosa Hunt)","Sex":"female","sum(PassengerId)":280.0},
//     {"Cabin":"null","Name":"Abbing, Mr. Anthony","Sex":"male","sum(PassengerId)":846.0},
//     {"Cabin":"null","Name":"Abbott, Mr. Rossmore Edward","Sex":"male","sum(PassengerId)":747.0},
//     {"Cabin":"null","Name":"Abbott, Mrs. Stanton (Rosa Hunt)","Sex":"male","sum(PassengerId)":NaN}
//   ]
// ]
// const data = [[{ 'sum(平均售价)': 224673.1603422169, 产品主类: 'null', 省份: '云南省' }, { 'sum(平均售价)': 152651.00725056458, 产品主类: '个人护理', 省份: '云南省' }, { 'sum(平均售价)': 20872.219285970976, 产品主类: '儿童', 省份: '云南省' }, { 'sum(平均售价)': 12474.006979522985, 产品主类: '化妆工具', 省份: '云南省' }, { 'sum(平均售价)': 151027.36789292688, 产品主类: 'null', 省份: '内蒙古' }, { 'sum(平均售价)': 120498.10066052998, 产品主类: '个人护理', 省份: '内蒙古' }, { 'sum(平均售价)': 24861.198397998996, 产品主类: '儿童', 省份: '内蒙古' }, { 'sum(平均售价)': 6730.269545268999, 产品主类: '化妆工具', 省份: '内蒙古' }, { 'sum(平均售价)': 90441.91736988217, 产品主类: 'null', 省份: '吉林省' }, { 'sum(平均售价)': 72176.88096334909, 产品主类: '个人护理', 省份: '吉林省' }, { 'sum(平均售价)': 12292.692097146986, 产品主类: '儿童', 省份: '吉林省' }, { 'sum(平均售价)': 5605.587629513004, 产品主类: '化妆工具', 省份: '吉林省' }, { 'sum(平均售价)': 273236.52796731517, 产品主类: 'null', 省份: '四川省' }, { 'sum(平均售价)': 228986.79260834813, 产品主类: '个人护理', 省份: '四川省' }, { 'sum(平均售价)': 28085.888543727993, 产品主类: '儿童', 省份: '四川省' }, { 'sum(平均售价)': 17066.88825098899, 产品主类: '化妆工具', 省份: '四川省' }]];
// const data = [
//   [
//     { Name: 'Abbott, Mr. Rossmore Edward', Sex: 'female', Ticket: 'C.A. 2673', 'sum(PassengerId)': NaN },
//     { Name: 'Abbott, Mrs. Stanton (Rosa Hunt)', Sex: 'female', Ticket: 'C.A. 2673', 'sum(PassengerId)': 280.0 },
//     { Name: 'Abbing, Mr. Anthony', Sex: 'female', Ticket: 'C.A. 5547', 'sum(PassengerId)': NaN },
//     { Name: 'Abbott, Mr. Rossmore Edward', Sex: 'male', Ticket: 'C.A. 2673', 'sum(PassengerId)': 747.0 },
//     { Name: 'Abbott, Mrs. Stanton (Rosa Hunt)', Sex: 'male', Ticket: 'C.A. 2673', 'sum(PassengerId)': NaN },
//     { Name: 'Abbing, Mr. Anthony', Sex: 'male', Ticket: 'C.A. 5547', 'sum(PassengerId)': 846.0 }
//   ]
// ];
// const data = [[{ 'sum(平均售价)': 224673.1603422169, 产品主类: 'null', 省份: '云南省' }, { 'sum(平均售价)': 152651.00725056458, 产品主类: '个人护理', 省份: '云南省' }, { 'sum(平均售价)': 20872.219285970976, 产品主类: '儿童', 省份: '云南省' }, { 'sum(平均售价)': 12474.006979522985, 产品主类: '化妆工具', 省份: '云南省' }]];
// const data = [[{ 'sum(平均售价)': 213.89026512599997, 产品主类: '个人护理', 城市: '临沧市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 221.62363722000003, 产品主类: '个人护理', 城市: '丽江市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 3.8, 产品主类: '个人护理', 城市: '大理白族自治州', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 13, 产品主类: '个人护理', 城市: '德宏傣族景颇族自治州', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 100, 产品主类: '个人护理', 城市: '思茅市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 59.528614428, 产品主类: '个人护理', 城市: '文山壮族苗族自治州', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 199.44070935699997, 产品主类: '个人护理', 城市: '昆明市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 67.477191556, 产品主类: '个人护理', 城市: '昭通市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 32.323530417, 产品主类: '个人护理', 城市: '曲靖市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 257.139607916, 产品主类: '个人护理', 城市: '楚雄彝族自治州', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 69.796363636, 产品主类: '个人护理', 城市: '玉溪市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 215.753102453, 产品主类: '个人护理', 城市: '红河哈尼族彝族自治州', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 31.460273283, 产品主类: '个人护理', 城市: '西双版纳傣族自治州', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 144.512203691, 产品主类: '个人护理', 城市: '迪庆藏族自治州', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 972.30711151, 产品主类: '个人护理', 城市: '临沧市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 1006.1366205530002, 产品主类: '个人护理', 城市: '丽江市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 466.65944444400003, 产品主类: '个人护理', 城市: '大理白族自治州', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 323.95583333, 产品主类: '个人护理', 城市: '德宏傣族景颇族自治州', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 624.9182957390001, 产品主类: '个人护理', 城市: '思茅市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 801.942171238, 产品主类: '个人护理', 城市: '文山壮族苗族自治州', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 2221.343345752999, 产品主类: '个人护理', 城市: '昆明市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 2010.3420857799997, 产品主类: '个人护理', 城市: '昭通市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 753.328518, 产品主类: '个人护理', 城市: '曲靖市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 1439.0024485400002, 产品主类: '个人护理', 城市: '楚雄彝族自治州', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 423, 产品主类: '个人护理', 城市: '玉溪市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 1911.8138887300001, 产品主类: '个人护理', 城市: '红河哈尼族彝族自治州', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 699.415447668, 产品主类: '个人护理', 城市: '西双版纳傣族自治州', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 658.1920833329999, 产品主类: '个人护理', 城市: '迪庆藏族自治州', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 13642.770233193994, 产品主类: '个人护理', 城市: '临沧市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 8039.387728498998, 产品主类: '个人护理', 城市: '丽江市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 2874.4863215, 产品主类: '个人护理', 城市: '大理白族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 1126.36144198, 产品主类: '个人护理', 城市: '德宏傣族景颇族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 6405.373640440998, 产品主类: '个人护理', 城市: '思茅市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 5826.037999862003, 产品主类: '个人护理', 城市: '文山壮族苗族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 24643.405448873997, 产品主类: '个人护理', 城市: '昆明市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 13852.751157108994, 产品主类: '个人护理', 城市: '昭通市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 4925.284038127001, 产品主类: '个人护理', 城市: '曲靖市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 18036.420089540003, 产品主类: '个人护理', 城市: '楚雄彝族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 5564.431050270002, 产品主类: '个人护理', 城市: '玉溪市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 17675.147623638008, 产品主类: '个人护理', 城市: '红河哈尼族彝族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 5067.715650160999, 产品主类: '个人护理', 城市: '西双版纳傣族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 9029.332033669005, 产品主类: '个人护理', 城市: '迪庆藏族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 60, 产品主类: '儿童', 城市: '临沧市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 34.257142857, 产品主类: '儿童', 城市: '丽江市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 83.85, 产品主类: '儿童', 城市: '昆明市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 44.699999999999996, 产品主类: '儿童', 城市: '昭通市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 11, 产品主类: '儿童', 城市: '曲靖市', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 55.633653845, 产品主类: '儿童', 城市: '楚雄彝族自治州', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 66, 产品主类: '儿童', 城市: '红河哈尼族彝族自治州', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 16.166666667, 产品主类: '儿童', 城市: '西双版纳傣族自治州', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 42.45, 产品主类: '儿童', 城市: '迪庆藏族自治州', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 7, 产品主类: '儿童', 城市: '临沧市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 27, 产品主类: '儿童', 城市: '丽江市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 12, 产品主类: '儿童', 城市: '大理白族自治州', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 434.780252101, 产品主类: '儿童', 城市: '文山壮族苗族自治州', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 52.7, 产品主类: '儿童', 城市: '昆明市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 202.75833333, 产品主类: '儿童', 城市: '昭通市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 71.9, 产品主类: '儿童', 城市: '曲靖市', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 116, 产品主类: '儿童', 城市: '楚雄彝族自治州', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 16, 产品主类: '儿童', 城市: '红河哈尼族彝族自治州', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 1453.491666664, 产品主类: '儿童', 城市: '临沧市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 1496.562642219, 产品主类: '儿童', 城市: '丽江市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 593.24666667, 产品主类: '儿童', 城市: '大理白族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 261.575268824, 产品主类: '儿童', 城市: '德宏傣族景颇族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 973.59523809, 产品主类: '儿童', 城市: '思茅市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 616.9438034229997, 产品主类: '儿童', 城市: '文山壮族苗族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 3120.4130960580005, 产品主类: '儿童', 城市: '昆明市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 2051.7746230180005, 产品主类: '儿童', 城市: '昭通市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 653.9831925790002, 产品主类: '儿童', 城市: '曲靖市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 2458.369379984, 产品主类: '儿童', 城市: '楚雄彝族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 793.75588889, 产品主类: '儿童', 城市: '玉溪市', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 3077.4295389910008, 产品主类: '儿童', 城市: '红河哈尼族彝族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 489.58793102999994, 产品主类: '儿童', 城市: '西双版纳傣族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 1477.294300731, 产品主类: '儿童', 城市: '迪庆藏族自治州', 是否为天美品牌: '非天美品牌', 省份: '云南省' }]];
// const data = [[{ 'sum(平均售价)': 111521.44459684005, 产品主类: 'null', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 9702.290537764002, 产品主类: 'null', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 52581.367048091, 产品主类: 'null', 城市: '张家界市', 省份: '湖南省' }, { 'sum(平均售价)': 3.5, 产品主类: '居家日用', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 150, 产品主类: '居家日用', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 19.8, 产品主类: '居家日用', 城市: '张家界市', 省份: '湖南省' }, { 'sum(平均售价)': 11825.222777690004, 产品主类: '彩妆', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 627.4039145300001, 产品主类: '彩妆', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 11053.607247209999, 产品主类: '彩妆', 城市: '张家界市', 省份: '湖南省' }]];
// const data = [[{ 'sum(平均售价)': 308.43875357700006, 产品主类: 'null', 是否为天美品牌: '天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 1817.8765797679998, 产品主类: 'null', 是否为天美品牌: '无品牌信息', 省份: '广东省' }, { 'sum(平均售价)': 64586.58071153701, 产品主类: 'null', 是否为天美品牌: '非天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 1354.1526075209995, 产品主类: 'null', 是否为天美品牌: '天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 5466.628146406999, 产品主类: 'null', 是否为天美品牌: '无品牌信息', 省份: '湖南省' }, { 'sum(平均售价)': 806065.5251097772, 产品主类: 'null', 是否为天美品牌: '非天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 559.9553357530003, 产品主类: '个人护理', 是否为天美品牌: '天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 6308.0381017490035, 产品主类: '个人护理', 是否为天美品牌: '无品牌信息', 省份: '广东省' }, { 'sum(平均售价)': 34273.32974653402, 产品主类: '个人护理', 是否为天美品牌: '非天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 2603.5561876409993, 产品主类: '个人护理', 是否为天美品牌: '天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 61442.55874816208, 产品主类: '个人护理', 是否为天美品牌: '无品牌信息', 省份: '湖南省' }, { 'sum(平均售价)': 452081.51891248004, 产品主类: '个人护理', 是否为天美品牌: '非天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 170.292589899, 产品主类: '儿童', 是否为天美品牌: '天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 1619.1706744869998, 产品主类: '儿童', 是否为天美品牌: '无品牌信息', 省份: '广东省' }, { 'sum(平均售价)': 7211.186457715, 产品主类: '儿童', 是否为天美品牌: '非天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 769.6725752750001, 产品主类: '儿童', 是否为天美品牌: '天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 2854.313900934001, 产品主类: '儿童', 是否为天美品牌: '无品牌信息', 省份: '湖南省' }, { 'sum(平均售价)': 49396.44591334519, 产品主类: '儿童', 是否为天美品牌: '非天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 979.389185166, 产品主类: '化妆工具', 是否为天美品牌: '天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 1336.347707008, 产品主类: '化妆工具', 是否为天美品牌: '无品牌信息', 省份: '广东省' }, { 'sum(平均售价)': 1123.623463503, 产品主类: '化妆工具', 是否为天美品牌: '非天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 4235.5924315340035, 产品主类: '化妆工具', 是否为天美品牌: '天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 9249.567325054993, 产品主类: '化妆工具', 是否为天美品牌: '无品牌信息', 省份: '湖南省' }, { 'sum(平均售价)': 12861.690225837001, 产品主类: '化妆工具', 是否为天美品牌: '非天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 1058.67900393, 产品主类: '居家日用', 是否为天美品牌: '天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 3367.5737414699993, 产品主类: '居家日用', 是否为天美品牌: '无品牌信息', 省份: '广东省' }, { 'sum(平均售价)': 5974.40983259, 产品主类: '居家日用', 是否为天美品牌: '非天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 4670.772915630007, 产品主类: '居家日用', 是否为天美品牌: '天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 11939.328046381977, 产品主类: '居家日用', 是否为天美品牌: '无品牌信息', 省份: '湖南省' }, { 'sum(平均售价)': 51684.021267970405, 产品主类: '居家日用', 是否为天美品牌: '非天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 2560.8263379359996, 产品主类: '彩妆', 是否为天美品牌: '天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 17515.01578418899, 产品主类: '彩妆', 是否为天美品牌: '无品牌信息', 省份: '广东省' }, { 'sum(平均售价)': 92913.0591810731, 产品主类: '彩妆', 是否为天美品牌: '非天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 15800.160067658984, 产品主类: '彩妆', 是否为天美品牌: '天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 209024.23384239525, 产品主类: '彩妆', 是否为天美品牌: '无品牌信息', 省份: '湖南省' }, { 'sum(平均售价)': 1100862.6936962777, 产品主类: '彩妆', 是否为天美品牌: '非天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 722.1315747250001, 产品主类: '护肤品', 是否为天美品牌: '天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 29612.164059559018, 产品主类: '护肤品', 是否为天美品牌: '无品牌信息', 省份: '广东省' }, { 'sum(平均售价)': 253451.9168419628, 产品主类: '护肤品', 是否为天美品牌: '非天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 5671.4064754599995, 产品主类: '护肤品', 是否为天美品牌: '天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 409631.9220545924, 产品主类: '护肤品', 是否为天美品牌: '无品牌信息', 省份: '湖南省' }, { 'sum(平均售价)': 2776415.5648787147, 产品主类: '护肤品', 是否为天美品牌: '非天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': null, 产品主类: '服饰', 是否为天美品牌: '天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 1062.1204622649998, 产品主类: '服饰', 是否为天美品牌: '无品牌信息', 省份: '广东省' }, { 'sum(平均售价)': 2443.117627736, 产品主类: '服饰', 是否为天美品牌: '非天美品牌', 省份: '广东省' }, { 'sum(平均售价)': null, 产品主类: '服饰', 是否为天美品牌: '天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 4693.356860812, 产品主类: '服饰', 是否为天美品牌: '无品牌信息', 省份: '湖南省' }, { 'sum(平均售价)': 4414.296729916001, 产品主类: '服饰', 是否为天美品牌: '非天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 211.49333332999998, 产品主类: '男士', 是否为天美品牌: '天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 276.24119658000006, 产品主类: '男士', 是否为天美品牌: '无品牌信息', 省份: '广东省' }, { 'sum(平均售价)': 12249.105368620007, 产品主类: '男士', 是否为天美品牌: '非天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 897.8275030499999, 产品主类: '男士', 是否为天美品牌: '天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 3371.76, 产品主类: '男士', 是否为天美品牌: '无品牌信息', 省份: '湖南省' }, { 'sum(平均售价)': 93179.20969584695, 产品主类: '男士', 是否为天美品牌: '非天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 211.51784188, 产品主类: '面膜', 是否为天美品牌: '天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 3321.8620906680007, 产品主类: '面膜', 是否为天美品牌: '无品牌信息', 省份: '广东省' }, { 'sum(平均售价)': 33124.57687321997, 产品主类: '面膜', 是否为天美品牌: '非天美品牌', 省份: '广东省' }, { 'sum(平均售价)': 988.4617735600001, 产品主类: '面膜', 是否为天美品牌: '天美品牌', 省份: '湖南省' }, { 'sum(平均售价)': 43749.58352738898, 产品主类: '面膜', 是否为天美品牌: '无品牌信息', 省份: '湖南省' }, { 'sum(平均售价)': 278911.49722106394, 产品主类: '面膜', 是否为天美品牌: '非天美品牌', 省份: '湖南省' }]];
// const data = [[{ 'sum(平均售价)': 23559.146554221006, 产品主类: 'null', 城市: '岳阳市', 省份: '湖南省' }, { 'sum(平均售价)': 111521.44459684005, 产品主类: 'null', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 9702.290537764002, 产品主类: 'null', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 18417.945236061976, 产品主类: '个人护理', 城市: '岳阳市', 省份: '湖南省' }, { 'sum(平均售价)': 58113.201238326095, 产品主类: '个人护理', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 4686.231813198001, 产品主类: '个人护理', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 2001.9995712690002, 产品主类: '儿童', 城市: '岳阳市', 省份: '湖南省' }, { 'sum(平均售价)': 7711.396362673, 产品主类: '儿童', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 1334.6272214970004, 产品主类: '儿童', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 489.278779819, 产品主类: '化妆工具', 城市: '岳阳市', 省份: '湖南省' }, { 'sum(平均售价)': 3772.028200442002, 产品主类: '化妆工具', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 259.55004962499993, 产品主类: '化妆工具', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 2370.8588360400013, 产品主类: '居家日用', 城市: '岳阳市', 省份: '湖南省' }, { 'sum(平均售价)': 7097.831162736996, 产品主类: '居家日用', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 2578.0475760039994, 产品主类: '居家日用', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 48436.416665268975, 产品主类: '彩妆', 城市: '岳阳市', 省份: '湖南省' }, { 'sum(平均售价)': 191289.22860189245, 产品主类: '彩妆', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 10183.005972291008, 产品主类: '彩妆', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 82916.33679419794, 产品主类: '护肤品', 城市: '岳阳市', 省份: '湖南省' }, { 'sum(平均售价)': 396717.24566667696, 产品主类: '护肤品', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 18957.199472257, 产品主类: '护肤品', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 37.566666667, 产品主类: '服饰', 城市: '岳阳市', 省份: '湖南省' }, { 'sum(平均售价)': 1335.8287813559998, 产品主类: '服饰', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 1093.2723754349997, 产品主类: '服饰', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 2761.59111902, 产品主类: '男士', 城市: '岳阳市', 省份: '湖南省' }, { 'sum(平均售价)': 16821.64158262699, 产品主类: '男士', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 1224.87244537, 产品主类: '男士', 城市: '广州市', 省份: '广东省' }, { 'sum(平均售价)': 7565.388676782997, 产品主类: '面膜', 城市: '岳阳市', 省份: '湖南省' }, { 'sum(平均售价)': 44193.41268688301, 产品主类: '面膜', 城市: '常德市', 省份: '湖南省' }, { 'sum(平均售价)': 1409.491669951, 产品主类: '面膜', 城市: '广州市', 省份: '广东省' }]];
// const data = [[{ Cabin: 'A10', Embarked: 'C', Name: 'Ross, Mr. John Hugo', Sex: 'female', 'sum(PassengerId)': null }, { Cabin: 'A16', Embarked: 'C', Name: 'Duff Gordon, Lady. (Lucille Christiana Sutherland) ("Mrs Morgan")', Sex: 'female', 'sum(PassengerId)': 557 }, { Cabin: 'A14', Embarked: 'S', Name: 'Clifford, Mr. George Quincy', Sex: 'female', 'sum(PassengerId)': null }, { Cabin: 'A19', Embarked: 'S', Name: 'Smith, Mr. Richard William', Sex: 'female', 'sum(PassengerId)': null }, { Cabin: 'A10', Embarked: 'C', Name: 'Ross, Mr. John Hugo', Sex: 'male', 'sum(PassengerId)': 584 }, { Cabin: 'A16', Embarked: 'C', Name: 'Duff Gordon, Lady. (Lucille Christiana Sutherland) ("Mrs Morgan")', Sex: 'male', 'sum(PassengerId)': null }, { Cabin: 'A14', Embarked: 'S', Name: 'Clifford, Mr. George Quincy', Sex: 'male', 'sum(PassengerId)': 476 }, { Cabin: 'A19', Embarked: 'S', Name: 'Smith, Mr. Richard William', Sex: 'male', 'sum(PassengerId)': 285 }]];
// const data = [[{ Cabin: 'null', Embarked: 'S', Name: 'Abbing, Mr. Anthony', Sex: 'female', 'sum(PassengerId)': null }, { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'female', 'sum(PassengerId)': null }, { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mrs. Stanton (Rosa Hunt)', Sex: 'female', 'sum(PassengerId)': 280 }, { Cabin: 'null', Embarked: 'S', Name: 'Abbing, Mr. Anthony', Sex: 'male', 'sum(PassengerId)': 846 }, { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mr. Rossmore Edward', Sex: 'male', 'sum(PassengerId)': 747 }, { Cabin: 'null', Embarked: 'S', Name: 'Abbott, Mrs. Stanton (Rosa Hunt)', Sex: 'male', 'sum(PassengerId)': null }]];
// [
//   {"Embarked":"S","Name":"Abbing, Mr. Anthony","Sex":"female","sum(PassengerId)":NaN},
//   {"Embarked":"S","Name":"Abbott, Mr. Rossmore Edward","Sex":"female","sum(PassengerId)":NaN},
//   {"Embarked":"S","Name":"Abbott, Mrs. Stanton (Rosa Hunt)","Sex":"female","sum(PassengerId)":280.0},
//   {"Embarked":"S","Name":"Abbing, Mr. Anthony","Sex":"male","sum(PassengerId)":846.0},
//   {"Embarked":"S","Name":"Abbott, Mr. Rossmore Edward","Sex":"male","sum(PassengerId)":747.0},
//   {"Embarked":"S","Name":"Abbott, Mrs. Stanton (Rosa Hunt)","Sex":"male","sum(PassengerId)":NaN}
// ]\
// const data = [[{ 'sum(平均售价)': 66.388236862, 产品主类: 'null', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 98.82862275, 产品主类: 'null', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 3869.1183889500003, 产品主类: 'null', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 54.097016514, 产品主类: 'null', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 53.316568489999995, 产品主类: 'null', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 13877.129151153003, 产品主类: 'null', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 71.695959596, 产品主类: '个人护理', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 506.88095238000005, 产品主类: '个人护理', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 5017.120457381999, 产品主类: '个人护理', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 109.116290019, 产品主类: '个人护理', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 916.9065564, 产品主类: '个人护理', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 13053.022352840997, 产品主类: '个人护理', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 27, 产品主类: '儿童', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': null, 产品主类: '儿童', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 606.73782052, 产品主类: '儿童', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 21.9, 产品主类: '儿童', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 135.787301587, 产品主类: '儿童', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 2560.159123124001, 产品主类: '儿童', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 318.34688312000003, 产品主类: '化妆工具', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 273.48046859600004, 产品主类: '化妆工具', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 242.09038095699998, 产品主类: '化妆工具', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 124.33612040199999, 产品主类: '化妆工具', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 78.26393939399999, 产品主类: '化妆工具', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 368.64444444299994, 产品主类: '化妆工具', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 115.808549782, 产品主类: '居家日用', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 33.780701757, 产品主类: '居家日用', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 220.327634841, 产品主类: '居家日用', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 105.748941116, 产品主类: '居家日用', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 57.540546663, 产品主类: '居家日用', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 980.938954209, 产品主类: '居家日用', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 624.4849299790001, 产品主类: '彩妆', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 1258.891430221, 产品主类: '彩妆', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 6722.229816509998, 产品主类: '彩妆', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 339.61372180399997, 产品主类: '彩妆', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 1135.7430115579998, 产品主类: '彩妆', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 18899.724929447017, 产品主类: '彩妆', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 216.57627960999997, 产品主类: '护肤品', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 3140.3010624799995, 产品主类: '护肤品', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 16796.764100689998, 产品主类: '护肤品', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 171.09604159399998, 产品主类: '护肤品', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 3343.3879967400003, 产品主类: '护肤品', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 82379.78235770701, 产品主类: '护肤品', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 78, 产品主类: '男士', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 39, 产品主类: '男士', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 1324.1638517299998, 产品主类: '男士', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 15, 产品主类: '男士', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': null, 产品主类: '男士', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 8837.012902092996, 产品主类: '男士', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': null, 产品主类: '面膜', 是否为天美品牌: '天美品牌', 省份: '云南省' }, { 'sum(平均售价)': 141, 产品主类: '面膜', 是否为天美品牌: '无品牌信息', 省份: '云南省' }, { 'sum(平均售价)': 2263.500662336, 产品主类: '面膜', 是否为天美品牌: '非天美品牌', 省份: '云南省' }, { 'sum(平均售价)': null, 产品主类: '面膜', 是否为天美品牌: '天美品牌', 省份: '内蒙古' }, { 'sum(平均售价)': 348.75384615, 产品主类: '面膜', 是否为天美品牌: '无品牌信息', 省份: '内蒙古' }, { 'sum(平均售价)': 6734.832260800001, 产品主类: '面膜', 是否为天美品牌: '非天美品牌', 省份: '内蒙古' }]];
// const data = [[{ 'sum(平均售价)': 120.485253376, 产品主类: 'null', 是否为天美品牌: '天美品牌' }, { 'sum(平均售价)': 152.14519124, 产品主类: 'null', 是否为天美品牌: '无品牌信息' }, { 'sum(平均售价)': 17746.247540103, 产品主类: 'null', 是否为天美品牌: '非天美品牌' }, { 'sum(平均售价)': 180.81224961499998, 产品主类: '个人护理', 是否为天美品牌: '天美品牌' }, { 'sum(平均售价)': 1423.78750878, 产品主类: '个人护理', 是否为天美品牌: '无品牌信息' }, { 'sum(平均售价)': 18070.142810223002, 产品主类: '个人护理', 是否为天美品牌: '非天美品牌' }, { 'sum(平均售价)': 48.9, 产品主类: '儿童', 是否为天美品牌: '天美品牌' }, { 'sum(平均售价)': 135.787301587, 产品主类: '儿童', 是否为天美品牌: '无品牌信息' }, { 'sum(平均售价)': 3166.8969436440007, 产品主类: '儿童', 是否为天美品牌: '非天美品牌' }, { 'sum(平均售价)': 442.68300352200004, 产品主类: '化妆工具', 是否为天美品牌: '天美品牌' }, { 'sum(平均售价)': 351.74440798999996, 产品主类: '化妆工具', 是否为天美品牌: '无品牌信息' }, { 'sum(平均售价)': 610.7348254, 产品主类: '化妆工具', 是否为天美品牌: '非天美品牌' }, { 'sum(平均售价)': 221.55749089800003, 产品主类: '居家日用', 是否为天美品牌: '天美品牌' }, { 'sum(平均售价)': 91.32124842, 产品主类: '居家日用', 是否为天美品牌: '无品牌信息' }, { 'sum(平均售价)': 1201.26658905, 产品主类: '居家日用', 是否为天美品牌: '非天美品牌' }, { 'sum(平均售价)': 964.098651783, 产品主类: '彩妆', 是否为天美品牌: '天美品牌' }, { 'sum(平均售价)': 2394.6344417789996, 产品主类: '彩妆', 是否为天美品牌: '无品牌信息' }, { 'sum(平均售价)': 25621.954745957, 产品主类: '彩妆', 是否为天美品牌: '非天美品牌' }, { 'sum(平均售价)': 387.67232120399996, 产品主类: '护肤品', 是否为天美品牌: '天美品牌' }, { 'sum(平均售价)': 6483.689059220001, 产品主类: '护肤品', 是否为天美品牌: '无品牌信息' }, { 'sum(平均售价)': 99176.54645839694, 产品主类: '护肤品', 是否为天美品牌: '非天美品牌' }, { 'sum(平均售价)': 93, 产品主类: '男士', 是否为天美品牌: '天美品牌' }, { 'sum(平均售价)': 39, 产品主类: '男士', 是否为天美品牌: '无品牌信息' }, { 'sum(平均售价)': 10161.176753823, 产品主类: '男士', 是否为天美品牌: '非天美品牌' }, { 'sum(平均售价)': null, 产品主类: '面膜', 是否为天美品牌: '天美品牌' }, { 'sum(平均售价)': 489.75384615, 产品主类: '面膜', 是否为天美品牌: '无品牌信息' }, { 'sum(平均售价)': 8998.332923136006, 产品主类: '面膜', 是否为天美品牌: '非天美品牌' }]];
// const data = [[{ 'sum(平均售价)': 4034.3352485620007, 产品主类: 'null', 省份: '云南省' }, { 'sum(平均售价)': 13984.542736157002, 产品主类: 'null', 省份: '内蒙古' }, { 'sum(平均售价)': 5595.6973693579985, 产品主类: '个人护理', 省份: '云南省' }, { 'sum(平均售价)': 14079.04519926, 产品主类: '个人护理', 省份: '内蒙古' }, { 'sum(平均售价)': 633.73782052, 产品主类: '儿童', 省份: '云南省' }, { 'sum(平均售价)': 2717.8464247110005, 产品主类: '儿童', 省份: '内蒙古' }, { 'sum(平均售价)': 833.9177326730002, 产品主类: '化妆工具', 省份: '云南省' }, { 'sum(平均售价)': 571.2445042389998, 产品主类: '化妆工具', 省份: '内蒙古' }, { 'sum(平均售价)': 369.91688638, 产品主类: '居家日用', 省份: '云南省' }, { 'sum(平均售价)': 1144.2284419879998, 产品主类: '居家日用', 省份: '内蒙古' }, { 'sum(平均售价)': 8605.606176710002, 产品主类: '彩妆', 省份: '云南省' }, { 'sum(平均售价)': 20375.081662809014, 产品主类: '彩妆', 省份: '内蒙古' }, { 'sum(平均售价)': 20153.64144278, 产品主类: '护肤品', 省份: '云南省' }, { 'sum(平均售价)': 85894.26639604098, 产品主类: '护肤品', 省份: '内蒙古' }, { 'sum(平均售价)': 1441.16385173, 产品主类: '男士', 省份: '云南省' }, { 'sum(平均售价)': 8852.012902092996, 产品主类: '男士', 省份: '内蒙古' }, { 'sum(平均售价)': 2404.500662336, 产品主类: '面膜', 省份: '云南省' }, { 'sum(平均售价)': 7083.5861069500015, 产品主类: '面膜', 省份: '内蒙古' }]];
let test = chart.GeometryDrawingProcess({ data, config, chartType: 'bar' });
test.draw();
